In [6]:
import sys
import os
sys.path.append(os.path.abspath('../src'))
from utils.cleaning import convert_money, convert_employees
import pandas as pd

In [7]:
# Lendo o CSV
df = pd.read_csv('../data/raw/top_100_saas_companies_2025.csv')

# Mostra as 5 primeiras linhas
df.head()

,Company Name,Founded Year,HQ,Industry,Total Funding,ARR,Valuation,Employees,Top Investors,Product,G2 Rating
0,Microsoft,1975,"Redmond, WA, USA",Enterprise Software,$1B,$270B,$3T,"221,000","Bill Gates, Paul Allen","Azure, Office 365, Teams",4.4
1,Salesforce,1999,"San Francisco, CA, USA",CRM,$65.4M,$37.9B,$227.8B,"75,000","Halsey Minor, Larry Ellison","Sales Cloud, Service Cloud",4.3
2,Adobe,1982,"San Jose, CA, USA",Creative Software,$2.5M,$19.4B,$240B,"29,945",Hambrecht & Quist,"Creative Cloud, Document Cloud",4.5
3,Oracle,1977,"Austin, TX, USA",Database & Enterprise,$2K,$52.9B,$350B,"143,000","Larry Ellison, Bob Miner","Oracle Cloud, NetSuite",4.0
4,SAP,1972,"Walldorf, Germany",Enterprise Software,NaN,$32.5B,$215B,"107,415","Dietmar Hopp, Klaus Tschira","S/4HANA, SuccessFactors",4.1

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company Name   100 non-null    object
 1   Founded Year   100 non-null    int64
 2   HQ             100 non-null    object
 3   Industry       100 non-null    object
 4   Total Funding  99 non-null     object
 5   ARR            100 non-null    object
 6   Valuation      100 non-null    object
 7   Employees      100 non-null    object
 8   Top Investors  100 non-null    object
 9   Product        100 non-null    object
 10  G2 Rating      100 non-null    float64
dtypes: float64(1), int64(1), object(9)
memory usage: 8.7+ KB

In [9]:
df.isnull().sum()

Company Name     0
Founded Year     0
HQ               0
Industry         0
Total Funding    1
ARR              0
Valuation        0
Employees        0
Top Investors    0
Product          0
G2 Rating        0
dtype: int64

In [10]:
df[['Total Funding', 'ARR', 'Valuation', 'Employees']].head(10)

  Total Funding     ARR Valuation Employees
0           $1B   $270B       $3T   221,000
1        $65.4M  $37.9B   $227.8B    75,000
2         $2.5M  $19.4B     $240B    29,945
3           $2K  $52.9B     $350B   143,000
4           NaN  $32.5B     $215B   107,415
5         $273M  $14.4B     $180B    18,200
6        $82.5M   $8.9B     $147B    20,000
7       $249.9M   $7.3B      $65B    18,800
8       $145.5M   $4.5B      $85B     7,388
9       $122.3M   $7.1B      $95B    11,600

In [11]:
df['Total Funding'] = df['Total Funding'].apply(convert_money)
df['ARR'] = df['ARR'].apply(convert_money)
df['Valuation'] = df['Valuation'].apply(convert_money)
df['Employees'] = df['Employees'].apply(convert_employees)

In [12]:
df.dtypes

Company Name      object
Founded Year       int64
HQ                object
Industry          object
Total Funding    float64
ARR              float64
Valuation        float64
Employees          int64
Top Investors     object
Product           object
G2 Rating        float64
dtype: object

In [14]:
df.to_csv('../data/processed/saas_companies_clean.csv', index=False)
print("CSV limpo salvo em data/processed.")

CSV limpo salvo em data/processed.